<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Authentication
    |--------------------------------------------------------------------------
    |
    | Логин  от iikoCloud.
    |
    */
    'login' => env('IIKO_CLOUD_LOGIN'),

    /*
    |--------------------------------------------------------------------------
    | HTTP
    |--------------------------------------------------------------------------
    */
    'base_uri' => env('IIKO_BASE_URI', 'https://api-ru.iiko.services/api/1/'),
    'timeout' => env('IIKO_CLOUD_TIMEOUT', 15.0),

    /*
    |--------------------------------------------------------------------------
    | Token cache
    |--------------------------------------------------------------------------
    |
    | TTL автоматически вычисляется из expiresIn ответа,
    | но можно жёстко ограничить сверху.
    |
    */
    'token_cache_ttl' => env('IIKO_TOKEN_TTL', 60 * 60 * 23), // 23 ч
    'cache_store' => env('IIKO_CACHE_STORE', null),        // null → driver по-умолчанию
];
